---
kind: type
id: T:Autodesk.Revit.ApplicationServices.Application
source: html/94db8ea8-d2c3-5e71-8030-466bcb8e4426.htm
---
# Autodesk.Revit.ApplicationServices.Application

Represents the Autodesk Revit Application, providing access to documents, options and other application wide data and settings.

## Syntax (C#)
```csharp
public class Application : IDisposable
```